let name = prompt ('ведите пароль');
alert (' проверь себя! ');
if(true){
    alert (' ответ: спосибо мы тебя взломаем!!!! ');


}
let namy = prompt ('ведите номер карты!!!');
alert (' проверь себя! ');
if(true){
    alert (' ответ: 9361 4509 2197 3688 ');
}
let nas = prompt ('сколько вам лет?');
if (nas < 18 ) {
    alert ('ты карапуз!!! ха');
} else if (nas > 18) {
alert ('ты такой старый?');
} else {
    alert('ты норм !')
}
let nasp = prompt ('твой любимый ютубер?');
if (nasp == 'эдисон') {
    alert ('правильно!');
    alert ('ты гений!!');
} else {
alert ('нет!');
}
let nasl = prompt ('твоя любимая игра?');
if (nasl == 'майнкрафт') {
    alert ('правильно!');
    alert ('ты гений!!');
} else {
alert ('чел скачай майнкрафт!');
}
let nasa = prompt ('сколько ты хочеш денег ?');
/*   if (nas < 1000000 ) {
    alert ('слишком мало!');
} else if (nas > 1000000) {
alert ('слишком много');
} else {
    alert('ты выйграл милион!!')
}      */

while(nasa<1000000){
nasa = prompt('слишком мало, введите ещё!');
}
alert('отлично!!! ты выиграл милион!!!')

